<a href="https://colab.research.google.com/github/prakharsrivastava/powerbi/blob/main/R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:

install.packages("ggplot2")

install.packages("plotrix")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [2]:

library("ggplot2")
library("dplyr")
library(tidyr)
library(tidyverse)

library("plotrix")

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union


Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.1 ──

✔ tibble  3.1.8     ✔ stringr 1.4.1
✔ readr   2.1.4     ✔ forcats 1.0.0
✔ purrr   1.0.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [5]:
numbers <- c('One','Two',"Three","Four","Five")
for(i in numbers) {
  if( i == "Four")
    break
  print(i)
}

[1] "One"
[1] "Two"
[1] "Three"

In [6]:
add <- function(x,y) {
  return (x + y)
}
# multiply function
mul <- function(x,y) {
  return (x * y)
}
# div function
div <- function(x,y) {
  return (x / y)
}

# calling functions sequentially
res1 <- add(2,4)
res2 <- mul(res1,8)
res3 <- div(res2,2)
print(res3)

[1] 24

In [7]:
res <- add(2,4) %>% mul(8) %>% div(2)
print(res)

[1] 24

In [8]:
df <- data.frame(
  id = c(10,11,12,13),
  name = c('sai','ram','deepika','sahithi'),
  gender = c('M','M','F','F'),
  dob = as.Date(c('1990-10-02','1981-3-24','1987-6-14','1985-8-16')),
  state = c('CA','NY',NA,NA),
  row.names=c('r1','r2','r3','r4')
)
df

# Load dplyr library
library('dplyr')

# filter() by row name & select id and name columns
df2 <- df %>% filter(rownames(df) == 'r3') %>% select(c('id','name'))
print(df2)

   id name    gender dob        state
r1 10 sai     M      1990-10-02 CA
r2 11 ram     M      1981-03-24 NY
r3 12 deepika F      1987-06-14 NA
r4 13 sahithi F      1985-08-16 NA

   id    name
r3 12 deepika

In [9]:
 rList <- list(emp_id=c(1,2,3,4,5,6),
           name=c("Smith","Rose","Williams"),
           dept_id=c(10,20,10,10,40,50))

rList

$emp_id
[1] 1 2 3 4 5 6

$name
[1] "Smith"    "Rose"     "Williams"

$dept_id
[1] 10 20 10 10 40 50

In [11]:
rList$emp_id

numeric(0)

In [12]:
id <- c(10,11,12,13)
name <- c('sai','ram','deepika','sahithi')
dob <- as.Date(c('1990-10-02','1981-3-24','1987-6-14','1985-8-16'))

# Create DataFrame
df <- data.frame(id,name,dob)

# Print DataFrame
df

  id name    dob
1 10 sai     1990-10-02
2 11 ram     1981-03-24
3 12 deepika 1987-06-14
4 13 sahithi 1985-08-16

In [14]:
df = data.frame(id=c(11,22),
              pages=c(32,45),
              name=c("spark","python"))

df[nrow(df) + 1,] <- c(33, 50, "java")
df

  id pages name
1 11 32    spark
2 22 45    python
3 33 50    java